KonradIT/DJI-ESP32-Remote/sdkconfig.defaults.m5stack_basic_v27
# Configuration for M5Stack Basic V2.7 (ESP32)
#
CONFIG_IDF_TARGET="esp32"

# Bluetooth configuration (NimBLE stack)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=4
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=500
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# NimBLE security ENABLED. The camera appears to require an encrypted link
# before it will act on application commands (it ATT-acks our writes but never
# answers them). Android negotiates this transparently; with SM compiled out we
# could not respond to a security request at all.
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y

# Flash configuration for M5Stack Basic V2.7 (16MB Flash)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# CPU frequency
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=240

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# SPI Configuration for Display
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# UART Configuration for GPS
CONFIG_UART_ISR_IN_IRAM=y

# Power Management
CONFIG_PM_ENABLE=y

# Partition Table - Custom table with 2MB app partition for LVGL + boot logo
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# LVGL core
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_DEF_REFR_PERIOD=33
CONFIG_LV_DPI_DEF=130

# Do NOT place LVGL code in IRAM -- ESP32 IRAM is tight with BLE stack
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=n

# Disable unused features to save RAM/flash
CONFIG_LV_USE_BIDI=n
CONFIG_LV_USE_ARABIC_PERSIAN_CHARS=n
CONFIG_LV_USE_SYSMON=n
CONFIG_LV_USE_PERF_MONITOR=n

# Fonts: Montserrat 12 (small), 14 (body) and 16 (headings)
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# Board selector
CONFIG_BOARD_M5STACK_BASIC_V27=y

# GPS configuration for M5Stack Basic v2.7
CONFIG_GPS_UART_NUM=2
CONFIG_GPS_UART_BAUD_RATE=115200
CONFIG_GPS_UART_TX_PIN=17
CONFIG_GPS_UART_RX_PIN=16

